app/controllers/members_controller.rb

INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["last_name", "Tully"], ["house_id", 124], ["created_at", "2018-01-18 19:00:23.066981"], ["updated_at", "2018-01-18 19:00:23.066981"]]
---
  def create
    @house = House.find(params[:house_id])
    @member = Member.create(member_params)